# Built In Failures Import Failures Import Contained Unsupported Geometric Data Property

Source: https://www.revitapidocs.com/2026/1d806eb3-1b91-2805-8e97-161743b9f8cd.htm

---

| Built In Failures Import Failures Import Contained Unsupported Geometric Data Property |
| --- |

The original model contains unsupported geometric data.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId ImportContainedUnsupportedGeometricData { get; }
```

```
Public Shared ReadOnly Property ImportContainedUnsupportedGeometricData As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ ImportContainedUnsupportedGeometricData {
	FailureDefinitionId^ get ();
}
```

```
static member ImportContainedUnsupportedGeometricData : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures ImportFailures Class Autodesk.Revit.DB Namespace